# dotfiles
brew "chezmoi"
brew "antigen"

# source code management
brew "git"
brew "gh"
brew "scmpuff"
brew "tokei"
brew "git-sizer"
brew "git-absorb"
# brew "git-delta"
brew "mroth/tap/bump"
brew "mroth/tap/consider"

# development: slice and dice
brew "jq"
brew "ripgrep"

# development: golang tooling
brew "go"
brew "golangci-lint"
brew "goreleaser"
# TODO: 
#   - go install golang.org/x/perf/cmd/benchstat@latest
#   - go install github.com/ajstarks/svgo/benchviz@latest

# development: protocol buffers / grpc
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"

# development: performance analysis
brew "hyperfine"
brew "pv"

# development: shell scripts
brew "shellcheck"
brew "shfmt"

# development: language grab-bag
brew "ruby"
brew "rust"
brew "node"
brew "ansible"

# productivity: cli
brew "coreutils"
brew "bat" # better cat
brew "exa" # better ls
brew "dust" # better du

# network tools
brew "curl"
brew "nmap"
brew "wget"
brew "speedtest-cli"
brew "yt-dlp"

# security: encryption and passwords
brew "gnupg"
brew "pdfcrack"
brew "pwgen"
brew "ykman"

# casks: general
cask "google-chrome"
cask "discord"
cask "zoom"
cask "soulver"

# casks: password management
cask "1password"    # needs post-install login
cask "authy"        # needs post-install login

# casks: development
cask "visual-studio-code"
cask "docker"       # needs post-install login
cask "github"       # needs post-install login
cask "gitup"
cask "dash"         # needs post-install license activation
# cask "google-cloud-sdk"

# casks: media encoding
cask "handbrake"
cask "imageoptim"
cask "licecap"

# casks: entertainment
cask "spotify"
# cask "sonos" #not yet Apple Silicon native grr
cask "transmission"
cask "vlc"
cask "iina"
cask "minecraft"

# app store
brew "mas"
mas "AwardWallet", id: 1473828829
mas "Boxy SVG", id: 611658502
mas "DaisyDisk", id: 411643860
mas "HomePass", id: 1330266650
mas "Ka-Block!", id: 1335413823
mas "Keynote", id: 409183694
mas "Parcel", id: 639968404
mas "Petrify", id: 1451177988
mas "PiPifier", id: 1160374471
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835
mas "TestFlight", id: 899247664
