# dotfiles
brew "chezmoi"
brew "antigen"

# source code management
brew "git"
brew "gh"
brew "jj"
brew "scmpuff"
brew "tokei"
brew "git-sizer"
brew "git-absorb"
brew "difftastic"
brew "mroth/tap/bump"
brew "mroth/tap/consider"

# development: slice and dice
brew "jq"
brew "ripgrep"
brew "helix"

# development: golang tooling
brew "go"
brew "golangci-lint"
brew "goreleaser"
go "golang.org/x/perf/cmd/benchstat"
go "github.com/ajstarks/svgo/benchviz"
go "golang.org/x/tools/cmd/deadcode"
go "github.com/Gelio/go-global-update"
go "github.com/mroth/go-bgtest"

# development: protocol buffers / grpc
brew "buf"
brew "protobuf"

# development: performance analysis
brew "hyperfine"
brew "pv"

# development: shell scripts
brew "shellcheck"
brew "shfmt"

# development: language grab-bag
brew "rust"
brew "node"
brew "ansible"

# productivity: cli
brew "coreutils"
brew "bat" # better cat
brew "eza" # better ls
brew "dust" # better du

# network tools
brew "curl"
brew "nmap"
brew "wget"
brew "speedtest-cli"
brew "yt-dlp"

# security: encryption and passwords
brew "gnupg"
brew "pwgen"
brew "ykman"

# casks: general
cask "google-chrome"
cask "discord"
cask "zoom"
cask "soulver"

# casks: password management
cask "1password"    # needs post-install login
cask "authy"        # needs post-install login

# casks: development
cask "visual-studio-code"
cask "zed"
cask "docker"       # needs post-install login
cask "github"       # needs post-install login
cask "gitup-app"

# casks: media encoding
cask "handbrake-app"
cask "imageoptim"
cask "licecap"

# casks: entertainment
cask "spotify"
# cask "sonos" #not yet Apple Silicon native grr
cask "transmission"
cask "vlc"
cask "iina"

# app store
# prefer app store over brew casks despite bad ergonomics,
# as sandboxing is enforced.
brew "mas"
mas "Boxy SVG", id: 611658502
mas "DaisyDisk", id: 411643860
mas "HomePass", id: 1330266650
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Parcel", id: 639968404
mas "Petrify", id: 1451177988
mas "PiPifier", id: 1160374471
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "Tailscale", id: 1475387142
mas "Wipr", id: 1320666476

# Xcode related
mas "Xcode", id: 497799835
mas "CommentHere", id: 1406737173
mas "TestFlight", id: 899247664
mas "Developer", id: 640199958
mas "DevCleaner", id: 1388020431
